Revit 2026 API

# NumberingSchemaRemoveGaps Method

---

Removes gaps, if any, in a numbering sequence

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveGaps(
	string partition
)
```
```vb
Public Sub RemoveGaps (
	partition As String
)
```
```cpp
public:
void RemoveGaps(
	String^ partition
)
```
```fsharp
member RemoveGaps :
        partition : string -> unit
```

#### Parameters

partition String
     Name of the partition that identifies the sequence. The sequence must exist.

| Exception | Condition |
| --- | --- |
| ArgumentException | The sequence partition does not exist in the schema. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Either the schema or its document cannot be modified at present. -or- Can't access the number while an async operation is running. |

Gaps are removed by shifting numbers above each gap down by the amount of numbers skipped in the gap. The lowest number in the sequence will remain unchanged.

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace